app/controllers/domains_controller.rb

SELECT "domains".* FROM "domains"
---
  def index
    @domains = Domain.all

INSERT INTO "domains" ("domain_name", "period", "contacts", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["domain_name", "dom1"], ["period", "5 years"], ["contacts", "admin handle"], ["created_at", "2020-06-23 22:48:52.664071"], ["updated_at", "2020-06-23 22:48:52.664071"]]
---
  def create
    @domain = Domain.new(domain_params)

    respond_to do |format|
      if @domain.save

DELETE FROM "domains" WHERE "domains"."id" = $1  [["id", 2]]
---
  def destroy
    @domain.destroy

SELECT  "domains".* FROM "domains" WHERE "domains"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_domain
      @domain = Domain.find(params[:id])