app/controllers/domains_controller.rb

SELECT "domains".* FROM "domains"
---
  def result
    host      = "172.16.46.55"
    username  = "testmrocafort"
    password  = "Password123"

    client = EPP::Client.new username, password, host

    command   = EPP::Host::Check.new params[:search]
    response  = client.check command
    check     = EPP::Host::CheckResponse.new response

    if check.available?
      puts "available"
      @domains = Domain.search(params[:search])

SELECT  "domains".* FROM "domains" WHERE "domains"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_domain
      @domain = Domain.find(params[:id])