app/models/domain.rb

	def self.search(search)
		if search
			domain = Domain.find_by(name: search)
---
SELECT  "domains".* FROM "domains" WHERE "domains"."name" = $1 LIMIT $2  [["name", "hi"], ["LIMIT", 1]]